python.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2024-09-01 dom 16:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python</title>
<meta name="author" content="Jackson de Jesus" />
<meta name="description" content="Resumo dos conceitos de Python" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org08d462d">Capítulo 1</a></li>
<li><a href="#org8bf6aa3">Capítulo 2</a></li>
<li><a href="#orgf3a7597">Capítulo 3</a></li>
<li><a href="#orga5c88c1">Capítulo 4</a></li>
<li><a href="#org3dde4ab">Capítulo 5</a></li>
<li><a href="#orga76cf9e">Capítulo 6</a></li>
<li><a href="#org5d5e6bc">Observações&#x2026;</a>
<ul>
<li><a href="#orgd12cc16">Como organizei o conteúdo desta página</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0535e6e">Voltar para o início&#x2026;</a></div>
</div>

<div id="outline-container-org08d462d" class="outline-3">
<h3 id="org08d462d">Capítulo 1</h3>
<div class="outline-text-3" id="text-org08d462d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Linguagem de Programação</b></b></td>
<td class="org-left">Domínio dos conceitos básicos como variáveis, estruturas de seleção e repetição, bibliotecas e leitura de documentação facilita o aprendizado de novas linguagens.</td>
</tr>

<tr>
<td class="org-left"><b><b>Bibliotecas</b></b></td>
<td class="org-left">Conjuntos de módulos (agrupamentos de funções) que fornecem funcionalidades prontas para diversas tarefas, como geração de gráficos e manipulação de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Vantagens das Bibliotecas</b></b></td>
<td class="org-left">Agilidade na adição de funcionalidades, possibilidade de testar diferentes implementações, fácil instalação e desinstalação.</td>
</tr>

<tr>
<td class="org-left"><b><b>Funções</b></b></td>
<td class="org-left">Blocos de código reutilizáveis que executam tarefas específicas, como a função `reajustar<sub>salario</sub>` que aplica um reajuste salarial a diferentes cargos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Bibliotecas Gráficas em Python</b></b></td>
<td class="org-left">Matplotlib (robusta e complexa), Seaborn (simples e esteticamente agradável) e Plotly (interativo).</td>
</tr>

<tr>
<td class="org-left"><b><b>NumPy</b></b></td>
<td class="org-left">Biblioteca que oferece a estrutura de dados ndarray, similar a listas, mas com vantagens em funcionalidades, performance e consumo de memória, especialmente para grandes conjuntos de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Pandas</b></b></td>
<td class="org-left">Biblioteca que usa o NumPy como base e introduz o DataFrame, uma estrutura de dados tabular poderosa para manipulação e análise de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>DataFrame</b></b></td>
<td class="org-left">Tipo de dado do Pandas que organiza dados em linhas e colunas, como uma tabela, facilitando a manipulação, análise e visualização de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Correlação</b></b></td>
<td class="org-left">Medida estatística que indica a relação entre duas variáveis. Uma correlação próxima de 1 indica uma relação diretamente proporcional, enquanto uma correlação próxima de -1 indica uma relação inversamente proporcional.</td>
</tr>

<tr>
<td class="org-left"><b><b>Expressões Regulares (Regex)</b></b></td>
<td class="org-left">Sequências de caracteres que formam padrões de busca, úteis para encontrar, validar e manipular textos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Aplicações de Regex</b></b></td>
<td class="org-left">Busca textual, validação de dados, web scraping e filtros em integrações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Módulo `re`</b></b></td>
<td class="org-left">Módulo do Python dedicado a expressões regulares, com funções para busca, substituição e manipulação de strings usando regex.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8bf6aa3" class="outline-3">
<h3 id="org8bf6aa3">Capítulo 2</h3>
<div class="outline-text-3" id="text-org8bf6aa3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Inteligência Artificial (IA)</b></b></td>
<td class="org-left">Um campo amplo com diversas abordagens, muitas vezes confundido com outros termos como Machine Learning. Apesar do termo evocar ideias de superinteligências, a IA atual é mais focada em algoritmos que aprendem com dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Machine Learning (ML)</b></b></td>
<td class="org-left">Um subcampo da IA que se concentra em algoritmos que aprendem padrões a partir de dados. É a base da maioria das aplicações de IA em empresas atualmente.</td>
</tr>

<tr>
<td class="org-left"><b><b>Aprendizagem Supervisionada</b></b></td>
<td class="org-left">Tipo de ML em que o algoritmo aprende com dados rotulados, ou seja, com exemplos de entradas e saídas desejadas. Divide-se em classificação (prever um grupo) e regressão (prever um valor numérico).</td>
</tr>

<tr>
<td class="org-left"><b><b>Aprendizagem Não Supervisionada</b></b></td>
<td class="org-left">Tipo de ML em que o algoritmo aprende padrões em dados não rotulados, buscando por similaridades e estruturas ocultas. Exemplos: redução de dimensionalidade e agrupamento (clustering).</td>
</tr>

<tr>
<td class="org-left"><b><b>Aprendizagem Por Reforço</b></b></td>
<td class="org-left">Tipo de ML em que o algoritmo aprende por tentativa e erro, recebendo recompensas por ações que levam a um objetivo. Usado em áreas como logística e jogos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Ciência de Dados</b></b></td>
<td class="org-left">Uma área multidisciplinar que utiliza IA, estatística e conhecimento específico de um domínio para extrair insights e valor de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Etapas de um Projeto de Ciência de Dados</b></b></td>
<td class="org-left">1. Definição do problema; 2. Definição dos dados; 3. Preparação dos dados; 4. Desenvolvimento dos modelos; 5. Avaliação dos modelos; 6. Disponibilização dos modelos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Preparação de Dados</b></b></td>
<td class="org-left">Fase crucial que pode consumir até 80% do tempo do projeto. Envolve entender, limpar, transformar e preparar os dados para serem usados pelos algoritmos de ML.</td>
</tr>

<tr>
<td class="org-left"><b><b>Bibliotecas em Python para ML</b></b></td>
<td class="org-left">Scikit-learn (versátil, com algoritmos de aprendizado supervisionado e não supervisionado), TensorFlow, Keras e PyTorch (redes neurais e deep learning), LightGBM e XGBoost (gradient boosting), Statsmodels (foco em estatística).</td>
</tr>

<tr>
<td class="org-left"><b><b>Matriz de Confusão</b></b></td>
<td class="org-left">Ferramenta para avaliar o desempenho de modelos de classificação, mostrando a quantidade de acertos e erros em cada classe.</td>
</tr>
</tbody>
</table>
</div>
</div>
