python.html

<div id="outline-container-orgf3a7597" class="outline-3">
<h3 id="orgf3a7597">Capítulo 3</h3>
<div class="outline-text-3" id="text-orgf3a7597">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Agente de Resolução de Problemas</b></b></td>
<td class="org-left">Um tipo de agente inteligente que decide as próximas ações buscando atingir um estado desejado, como encontrar a rota mais curta entre cidades.</td>
</tr>

<tr>
<td class="org-left"><b><b>Formulação de Problemas</b></b></td>
<td class="org-left">Processo crucial na IA que define: 1) Estado inicial do agente; 2) Função sucessor: ações válidas em cada estado e os estados resultantes; 3) Teste de objetivo: verifica se um estado é o objetivo; 4) Função de custo: avalia o custo de cada caminho (sequência de ações).</td>
</tr>

<tr>
<td class="org-left"><b><b>Espaço de Estados</b></b></td>
<td class="org-left">Representação de todos os estados possíveis que podem ser alcançados a partir do estado inicial, geralmente ilustrado como um grafo.</td>
</tr>

<tr>
<td class="org-left"><b><b>Árvore de Busca</b></b></td>
<td class="org-left">Estrutura gerada durante a busca por uma solução. A raiz é o estado inicial, e os ramos são criados expandindo nós (estados) com suas ações e estados sucessores.</td>
</tr>

<tr>
<td class="org-left"><b><b>Estratégia de Busca</b></b></td>
<td class="org-left">Define a ordem de expansão dos nós na árvore de busca, impactando a eficiência na localização da solução.</td>
</tr>

<tr>
<td class="org-left"><b><b>Busca Sem Informação (Cega)</b></b></td>
<td class="org-left">Estratégias que exploram o espaço de estados sem conhecimento específico do problema, como busca em extensão (largura) e busca em profundidade.</td>
</tr>

<tr>
<td class="org-left"><b><b>Busca com Informação (Heurística)</b></b></td>
<td class="org-left">Estratégias que usam conhecimento do problema (heurísticas) para guiar a busca de forma mais eficiente, como a busca gulosa e o algoritmo A*.</td>
</tr>

<tr>
<td class="org-left"><b><b>Função Heurística (h(n))</b></b></td>
<td class="org-left">Função que estima o custo do caminho do nó atual (n) até o objetivo, fornecendo conhecimento específico do problema para a busca com informação.</td>
</tr>

<tr>
<td class="org-left"><b><b>Algoritmo A*</b></b></td>
<td class="org-left">Estratégia de busca heurística que combina o custo do caminho até o nó atual (g(n)) com a heurística (h(n)) para estimar o custo total, buscando o caminho de menor custo estimado.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga5c88c1" class="outline-3">
<h3 id="orga5c88c1">Capítulo 4</h3>
<div class="outline-text-3" id="text-orga5c88c1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Algoritmos</b></b></td>
<td class="org-left">Servem para criar soluções, aplicações e plataformas que resolvem problemas específicos, como gerenciar vendas, oferecer serviços bancários ou proporcionar entretenimento.</td>
</tr>

<tr>
<td class="org-left"><b><b>Integração de Sistemas</b></b></td>
<td class="org-left">Sistemas diferentes, mesmo escritos em linguagens diversas e criados em momentos e locais distintos, precisam se comunicar para funcionar em conjunto.</td>
</tr>

<tr>
<td class="org-left"><b><b>Padrões de Comunicação</b></b></td>
<td class="org-left">Assim como idiomas comuns facilitam a comunicação entre pessoas de diferentes nacionalidades, arquivos com formatos padronizados como XML e JSON permitem a troca de dados entre sistemas.</td>
</tr>

<tr>
<td class="org-left"><b><b>XML (Extensible Markup Language)</b></b></td>
<td class="org-left">Formato de arquivo com estrutura hierárquica em árvore, semelhante ao HTML, usado para transportar dados entre sistemas, como documentos. Pode ser verboso para grandes volumes de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>JSON (JavaScript Object Notation)</b></b></td>
<td class="org-left">Alternativa mais leve ao XML, utiliza pares chave-valor para representar dados de forma estruturada. É mais conciso e fácil de ler para humanos e máquinas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Encoding</b></b></td>
<td class="org-left">Padrão que define como caracteres são convertidos em bytes para armazenamento e processamento em computadores. UTF-8 é o padrão dominante atualmente, suportando uma vasta gama de caracteres.</td>
</tr>

<tr>
<td class="org-left"><b><b>CSV (Comma-Separated Values)</b></b></td>
<td class="org-left">Formato de arquivo simples em que cada linha representa uma linha de tabela e os valores são separados por vírgulas (ou outro delimitador). Útil para transferir dados entre sistemas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Parquet</b></b></td>
<td class="org-left">Formato de arquivo colunar otimizado para Big Data, armazenando dados por coluna em vez de por linha, o que acelera consultas e economiza espaço.</td>
</tr>

<tr>
<td class="org-left"><b><b>SQLite</b></b></td>
<td class="org-left">Banco de dados relacional leve que opera localmente, sem a necessidade de um servidor separado. Útil para dispositivos com recursos limitados, desenvolvimento e prototipagem.</td>
</tr>

<tr>
<td class="org-left"><b><b>Persistência de Dados</b></b></td>
<td class="org-left">Armazenamento de dados de forma permanente para uso futuro, seja localmente (arquivos, bancos de dados locais) ou remotamente (APIs, serviços na nuvem).</td>
</tr>

<tr>
<td class="org-left"><b><b>Pickle</b></b></td>
<td class="org-left">Funcionalidade específica do Python para serializar e desserializar objetos Python, permitindo salvar e carregar variáveis complexas em arquivos.</td>
</tr>

<tr>
<td class="org-left"><b><b>APIs (Application Programming Interfaces)</b></b></td>
<td class="org-left">Interfaces que permitem a comunicação entre diferentes softwares, expondo funcionalidades e dados de forma estruturada. REST é um estilo arquitetural popular para APIs.</td>
</tr>

<tr>
<td class="org-left"><b><b>REST (Representational State Transfer)</b></b></td>
<td class="org-left">Estilo arquitetural para APIs que utiliza os métodos HTTP (GET, POST, etc.) para acessar e manipular recursos.</td>
</tr>
</tbody>
</table>
</div>
</div>
