python.html

<div id="outline-container-org3dde4ab" class="outline-3">
<h3 id="org3dde4ab">Capítulo 5</h3>
<div class="outline-text-3" id="text-org3dde4ab">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Iterações</b></b></td>
<td class="org-left">Repetições de ações, como percorrer os elementos de uma lista (string, array, etc.).</td>
</tr>

<tr>
<td class="org-left"><b><b>Iteradores</b></b></td>
<td class="org-left">Objetos que permitem percorrer elementos de uma sequência de dados. Em Python, podem ser usados com strings, listas, dicionários, tuplas, arrays NumPy, DataFrames pandas, etc..</td>
</tr>

<tr>
<td class="org-left"><b><b>`for` loop</b></b></td>
<td class="org-left">Estrutura de repetição que itera sobre uma sequência de dados, executando um bloco de código para cada elemento.</td>
</tr>

<tr>
<td class="org-left"><b><b>`while` loop</b></b></td>
<td class="org-left">Estrutura de repetição que executa um bloco de código enquanto uma condição for verdadeira.</td>
</tr>

<tr>
<td class="org-left"><b><b>Iteradores Infinitos</b></b></td>
<td class="org-left">Funções como `count`, `cycle` e `repeat` do módulo `itertools` que geram sequências infinitas de elementos.</td>
</tr>

<tr>
<td class="org-left"><b><b>`count(start, step)`</b></b></td>
<td class="org-left">Gera uma sequência numérica infinita a partir de `start`, incrementando a cada passo por `step`.</td>
</tr>

<tr>
<td class="org-left"><b><b>`cycle(iterable)`</b></b></td>
<td class="org-left">Gera uma sequência infinita repetindo os elementos de `iterable` na ordem original.</td>
</tr>

<tr>
<td class="org-left"><b><b>`repeat(object, times)`</b></b></td>
<td class="org-left">Gera uma sequência que repete `object` por `times` vezes. Se `times` não for especificado, a repetição é infinita.</td>
</tr>

<tr>
<td class="org-left"><b><b>Combinações</b></b></td>
<td class="org-left">Subconjuntos de elementos de um conjunto maior, onde a ordem dos elementos <b><b>não</b></b> importa. `combinations(iterable, r)` gera combinações de `r` elementos de `iterable` sem repetição.</td>
</tr>

<tr>
<td class="org-left"><b><b>Combinações com Repetição</b></b></td>
<td class="org-left">Subconjuntos de elementos onde a repetição de um mesmo elemento é permitida. `combinations<sub>with</sub><sub>replacement</sub>(iterable, r)` gera combinações de `r` elementos de `iterable` com repetição permitida.</td>
</tr>

<tr>
<td class="org-left"><b><b>Permutações</b></b></td>
<td class="org-left">Arranjos de elementos de um conjunto onde a ordem dos elementos <b><b>importa</b></b>. `permutations(iterable, r)` gera todas as permutações possíveis de `r` elementos de `iterable`.</td>
</tr>

<tr>
<td class="org-left"><b><b>Generators</b></b></td>
<td class="org-left">Funções especiais que retornam um iterador (lazy iterator) em vez de um valor. Usam a palavra-chave `yield` para retornar um valor de cada vez, economizando memória.</td>
</tr>

<tr>
<td class="org-left"><b><b>`yield` keyword</b></b></td>
<td class="org-left">Retorna um valor do generator e pausa a execução da função, preservando seu estado. Na próxima chamada, a função continua de onde parou.</td>
</tr>

<tr>
<td class="org-left"><b><b>Sobrecarga de Operadores</b></b></td>
<td class="org-left">Capacidade de definir o comportamento de operadores (+, -, *, etc.) para tipos de dados personalizados (classes).</td>
</tr>

<tr>
<td class="org-left"><b><b>Métodos especiais (dunder methods)</b></b></td>
<td class="org-left">Métodos com nomes predefinidos (como `_<sub>add</sub>__`, `_<sub>sub</sub>__`, etc.) que permitem sobrecarregar operadores em Python. `_<sub>add</sub>__` define o comportamento do operador `+` para a classe.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga76cf9e" class="outline-3">
<h3 id="orga76cf9e">Capítulo 6</h3>
<div class="outline-text-3" id="text-orga76cf9e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Sustentabilidade em TI</b></b></td>
<td class="org-left">Vai além de questões ambientais e abrange a capacidade de um software  se manter funcional e relevante ao longo do tempo.</td>
</tr>

<tr>
<td class="org-left"><b><b>Otimização</b></b></td>
<td class="org-left">Em software, significa melhorar a eficiência, seja do algoritmo (código) ou dos processos da organização.</td>
</tr>

<tr>
<td class="org-left"><b><b>Otimização de Processos</b></b></td>
<td class="org-left">Refere-se à melhoria da gestão e das práticas de desenvolvimento de software, incluindo governança de TI, segurança e boas práticas de codificação.</td>
</tr>

<tr>
<td class="org-left"><b><b>CMMI (Capability Maturity Model Integration)</b></b></td>
<td class="org-left">Modelo para avaliar a maturidade de uma organização em desenvolvimento de software, com níveis como "Inicial", "Gerenciado" e "Em Otimização".</td>
</tr>

<tr>
<td class="org-left"><b><b>Otimização de Algoritmos</b></b></td>
<td class="org-left">Visa tornar o código mais eficiente, analisando a quantidade de cálculos, uso de memória e tempo de execução, geralmente expressos pela notação Big O.</td>
</tr>

<tr>
<td class="org-left"><b><b>Big O (Notação Assintótica)</b></b></td>
<td class="org-left">Representação da performance de um algoritmo em relação ao crescimento do volume de dados processados, indicando se o tempo de execução cresce de forma constante, linear, quadrática, etc.</td>
</tr>

<tr>
<td class="org-left"><b><b>Complexidade Fatorial (O(n!))</b></b></td>
<td class="org-left">Representa algoritmos extremamente ineficientes, cujo tempo de execução cresce exponencialmente com o tamanho da entrada, como alguns algoritmos de força bruta.</td>
</tr>

<tr>
<td class="org-left"><b><b>Processos</b></b></td>
<td class="org-left">Espaços isolados na memória onde um algoritmo é executado, consumindo recursos e com tempo de criação e término.</td>
</tr>

<tr>
<td class="org-left"><b><b>Threads</b></b></td>
<td class="org-left">Pequenos trechos de um algoritmo que podem ser executados concorrentemente dentro de um mesmo processo, compartilhando recursos e sendo mais leves que processos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Escalabilidade</b></b></td>
<td class="org-left">Capacidade de um sistema lidar com o aumento da demanda de forma eficiente, seja em termos de volume de dados, usuários ou complexidade.</td>
</tr>

<tr>
<td class="org-left"><b><b>CPython</b></b></td>
<td class="org-left">Implementação de referência do Python, escrita em C e Python, sendo a mais utilizada e com suporte prioritário para novas funcionalidades da linguagem.</td>
</tr>

<tr>
<td class="org-left"><b><b>Implementação de Linguagem</b></b></td>
<td class="org-left">Software que interpreta o código escrito em uma linguagem (como Python) e o executa, traduzindo as instruções em ações concretas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Protocolos (Interfaces)</b></b></td>
<td class="org-left">Em Python, são como "contratos" que definem métodos que uma classe deve implementar, garantindo padronização e funcionalidade.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5d5e6bc" class="outline-3">
<h3 id="org5d5e6bc">Observações&#x2026;</h3>
<div class="outline-text-3" id="text-org5d5e6bc">
</div>
<div id="outline-container-orgd12cc16" class="outline-4">
<h4 id="orgd12cc16">Como organizei o conteúdo desta página</h4>
<div class="outline-text-4" id="text-orgd12cc16">
<p>
Esta página contém resumos dos principais conceitos de Python extraídos de arquivos no formato PDF com a ferramenta <a href="https://notebooklm.google.com">NotebookLM</a>.
</p>

<p>
De forma simples, enviei os arquivos para o NotebookLM e pedi os resumos com os seguintes comandos:
</p>

<p>
<b>Organize uma tabela com os principais conceitos do texto. Na primeira coluna, o nome do conceito e na segunda, o conceito em si.</b>
</p>

<p>
A partir do segundo pedido, usei o comando:
</p>

<p>
<b>Repita o processo anterior para este texto.</b>
</p>

<p>
No terceiro pedido, recebi a mensage de:
</p>

<p>
<b>O comando fornecido solicita que o processo anterior seja repetido. No entanto, não há processo anterior no histórico de conversas fornecido. [Me] Para obter uma resposta abrangente, forneça o processo anterior que você gostaria que fosse repetido.</b>
</p>

<p>
Desta forma, alternei entre o primeiro e segundo comando até o último arquivo, que veio com a formatação Markdown deformada. Então, pedi uma última revisão com o comando:
</p>

<p>
<b>Refaça a tabela para uma melhor formatação em Markdown.</b>
</p>

<p>
A publicação final continua uma exportação simples, do formato org mode para HTML, usando o Emacs.
</p>
</div>
</div>
</div>

<div id="outline-container-org0535e6e" class="outline-2">
<h2 id="org0535e6e"><a href="./index.html">Voltar para o início&#x2026;</a></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jackson de Jesus</p>
<p class="date">Created: 2024-09-01 dom 16:03</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
